{"id":736,"fid":736,"name":"Parse Lisp Expression","slug":"parse-lisp-expression","link":"https://leetcode.com/problems/parse-lisp-expression/description/","percent":40.90851893796401,"level":"Hard","category":"algorithms","totalAC":"3.3K","totalSubmit":"7.9K","desc":"\r\nYou are given a string expression representing a Lisp-like expression to return the integer value of.\r\n\r\nThe syntax for these expressions is given as follows.\r\n\r\nAn expression is either an integer, a let-expression, an add-expression, a mult-expression, or an assigned variable.  Expressions always evaluate to a single integer.\r\n\r\n(An integer could be positive or negative.)\r\n\r\nA let-expression takes the form (let v1 e1 v2 e2 ... vn en expr), where let is always the string \"let\", then there are 1 or more pairs of alternating variables and expressions, meaning that the first variable v1 is assigned the value of the expression e1, the second variable v2 is assigned the value of the expression e2, and so on sequentially; and then the value of this let-expression is the value of the expression expr.\r\n\r\nAn add-expression takes the form (add e1 e2) where add is always the string \"add\", there are always two expressions e1, e2, and this expression evaluates to the addition of the evaluation of e1 and the evaluation of e2.\r\n\r\nA mult-expression takes the form (mult e1 e2) where mult is always the string \"mult\", there are always two expressions e1, e2, and this expression evaluates to the multiplication of the evaluation of e1 and the evaluation of e2.\r\n\r\nFor the purposes of this question, we will use a smaller subset of variable names.  A variable starts with a lowercase letter, then zero or more lowercase letters or digits.  Additionally for your convenience, the names \"add\", \"let\", or \"mult\" are protected and will never be used as variable names.\r\n\r\nFinally, there is the concept of scope.  When an expression of a variable name is evaluated, within the context of that evaluation, the innermost scope (in terms of parentheses) is checked first for the value of that variable, and then outer scopes are checked sequentially.  It is guaranteed that every expression is legal.  Please see the examples for more details on scope.\r\n\r\n\r\nEvaluation Examples:\r\n\r\nInput: (add 1 2)\r\nOutput: 3\r\n\r\nInput: (mult 3 (add 2 3))\r\nOutput: 15\r\n\r\nInput: (let x 2 (mult x 5))\r\nOutput: 10\r\n\r\nInput: (let x 2 (mult x (let x 3 y 4 (add x y))))\r\nOutput: 14\r\nExplanation: In the expression (add x y), when checking for the value of the variable x,\r\nwe check from the innermost scope to the outermost in the context of the variable we are trying to evaluate.\r\nSince x = 3 is found first, the value of x is 3.\r\n\r\nInput: (let x 3 x 2 x)\r\nOutput: 2\r\nExplanation: Assignment in let statements is processed sequentially.\r\n\r\nInput: (let x 1 y 2 x (add x y) (add x y))\r\nOutput: 5\r\nExplanation: The first (add x y) evaluates as 3, and is assigned to x.\r\nThe second (add x y) evaluates as 3+2 = 5.\r\n\r\nInput: (let x 2 (add (let x 3 (let x 4 x)) x))\r\nOutput: 6\r\nExplanation: Even though (let x 4 x) has a deeper scope, it is outside the context\r\nof the final x in the add-expression.  That final x will equal 2.\r\n\r\nInput: (let a1 3 b2 (add a1 1) b2) \r\nOutput 4\r\nExplanation: Variable names can contain digits after the first character.\r\n\r\n\r\n\r\nNote:\r\nThe given string expression is well formatted: There are no leading or trailing spaces, there is only a single space separating different components of the string, and no space between adjacent parentheses.  The expression is guaranteed to be legal and evaluate to an integer.\r\nThe length of expression is at most 2000.  (It is also non-empty, as that would not be a legal expression.)\r\nThe answer and all intermediate calculations of that answer are guaranteed to fit in a 32-bit integer.\r\n","templates":[{"value":"cpp","text":"C++","defaultCode":"class Solution {\npublic:\n    int evaluate(string expression) {\n        \n    }\n};"},{"value":"java","text":"Java","defaultCode":"class Solution {\n    public int evaluate(String expression) {\n        \n    }\n}"},{"value":"python","text":"Python","defaultCode":"class Solution(object):\n    def evaluate(self, expression):\n        \"\"\"\n        :type expression: str\n        :rtype: int\n        \"\"\"\n        "},{"value":"python3","text":"Python3","defaultCode":"class Solution:\n    def evaluate(self, expression):\n        \"\"\"\n        :type expression: str\n        :rtype: int\n        \"\"\"\n        "},{"value":"c","text":"C","defaultCode":"int evaluate(char* expression) {\n    \n}"},{"value":"csharp","text":"C#","defaultCode":"public class Solution {\n    public int Evaluate(string expression) {\n        \n    }\n}"},{"value":"javascript","text":"JavaScript","defaultCode":"/**\n * @param {string} expression\n * @return {number}\n */\nvar evaluate = function(expression) {\n    \n};"},{"value":"ruby","text":"Ruby","defaultCode":"# @param {String} expression\n# @return {Integer}\ndef evaluate(expression)\n    \nend"},{"value":"swift","text":"Swift","defaultCode":"class Solution {\n    func evaluate(_ expression: String) -> Int {\n\n    }\n}"},{"value":"golang","text":"Go","defaultCode":"func evaluate(expression string) int {\n    \n}"},{"value":"scala","text":"Scala","defaultCode":"object Solution {\n    def evaluate(expression: String): Int = {\n        \n    }\n}"},{"value":"kotlin","text":"Kotlin","defaultCode":"class Solution {\n    fun evaluate(expression: String): Int {\n        \n    }\n}"}],"testcase":"\"(add 1 2)\"","testable":true,"templateMeta":{"name":"evaluate","params":[{"name":"expression","type":"string"}],"return":{"type":"integer"}}}